export const register =  {
  title: '注册协议',
  content: [
    {
      title: '',
      content: [
        `
          感谢您注册DZQ帐号！在成为耀星社区用户之前，请您仔细阅读以下条文，
          确保您理解并同意本协议全部内容。以下内容将构成您和耀星社区的服务合同条款。
        `
      ]
    },
    {
      title: '一、用户注册',
      content: [
        `
          您同意本协议并注册成功即成为DZQ社区的注册用户。
          DZQ社区可能在必要的时候对本协议条款及DZQ区论坛各单项服务协议进行更改，
          此种更改在论坛上公布或在具体服务过程中经双方以口头、书面等形式协商一致生效。
          您可以选择停止使用DZQ社区相关的服务，否则DZQ社区将认为您同意更改后的服务条款。
          未在DZQ社区论坛发布或在具体服务过程中未经告知的服务条款将不具有法律效力，除非签有书面协议，
          并且仅对签署协议的当事人有效。
        `
      ]
    },
    {
      title: '二、用户账户',
      content: [
        `
          您应当拥有中华人民共和国法律认可的完全民事权利能力和完全民事行为能力，
          否则您和能够代表您行使权利或承担责任的其他主体将承担一切后果。
          为此，您应当提供相应的证明。如果您是自然人，此类证明可以是您的居民身份证件、个人户营业执照。
          如果您是法人，此类证明可以是您的营业执照。如果您是其他组织类型，您应当提供相应的合法证明。
        `,
        `
          如果使用DZQ社区提供的论坛服务，您可能还需要提交其他相关的资料和信息。为了提供更好的服务，
          您也可以向我们提供其他资料和信息，我们将按照DZQ社区的隐私政策保护您的资料和信息。
        `,
        `
          您应当保护好您的账户，除非已经得到您的提前通知，DZQ社区将认为您的账户处于您的控制之下。
          如果您的账户在不受您控制的情况下处于风险状态或者已经发生损失，请您及时以有效方式通知DZQ社区，
          您可以要求DZQ社区禁用账户。
        `,
        `
          如果您使用DZQ账号直接访问其他网站，您应当遵守该网站的服务条款。
        `
      ]
    }
  ]
}

export const privacy =  {
  title: '隐私协议',
  content: [
    {
      title: '',
      content: [
        `
          感谢您注册DZQ帐号！在成为耀星社区用户之前，请您仔细阅读以下条文，
          确保您理解并同意本协议全部内容。以下内容将构成您和耀星社区的服务合同条款。
        `
      ]
    }
  ]
}
